tests/fixtures/nordpool_spot_price_today_tomorrow.yaml

state_class: total
average: 0.19929166666666667
off_peak_1: 0.0385
off_peak_2: 0.24443421052631578
peak: 0.020583333333333332
min: 0.012
max: 0.813
mean: 0.049
unit: kWh
currency: SEK
country: Sweden
region: SE4
low_price: false
price_percent_to_average: 1.4952958394313192
today:
  - 0.059
  - 0.048
  - 0.041
  - 0.036
  - 0.035
  - 0.032
  - 0.031
  - 0.026
  - 0.033
  - 0.031
  - 0.023
  - 0.019
  - 0.019
  - 0.018
  - 0.017
  - 0.018
  - 0.016
  - 0.017
  - 0.017
  - 0.019
  - 0.012
  - 0.014
  - 0.016
  - 0.017
  - 0.014
  - 0.013
  - 0.015
  - 0.016
  - 0.019
  - 0.019
  - 0.035
  - 0.04
  - 0.04
  - 0.049
  - 0.049
  - 0.049
  - 0.047
  - 0.049
  - 0.046
  - 0.04
  - 0.048
  - 0.047
  - 0.044
  - 0.035
  - 0.05
  - 0.049
  - 0.049
  - 0.049
  - 0.048
  - 0.048
  - 0.048
  - 0.058
  - 0.056
  - 0.056
  - 0.055
  - 0.055
  - 0.055
  - 0.056
  - 0.058
  - 0.154
  - 0.059
  - 0.059
  - 0.16
  - 0.299
  - 0.298
  - 0.369
  - 0.359
  - 0.351
  - 0.37
  - 0.455
  - 0.65
  - 0.637
  - 0.718
  - 0.77
  - 0.795
  - 0.813
  - 0.691
  - 0.68
  - 0.651
  - 0.672
  - 0.653
  - 0.648
  - 0.652
  - 0.364
  - 0.635
  - 0.607
  - 0.346
  - 0.347
  - 0.386
  - 0.324
  - 0.338
  - 0.347
  - 0.332
  - 0.343
  - 0.345
  - 0.337
tomorrow:
  - 0.334
  - 0.365
  - 0.361
  - 0.303
  - 0.286
  - 0.283
  - 0.284
  - 0.283
  - 0.281
  - 0.278
  - 0.28
  - 0.279
  - 0.266
  - 0.268
  - 0.266
  - 0.267
  - 0.361
  - 0.373
  - 0.725
  - 0.731
  - 0.669
  - 0.773
  - 0.821
  - 0.902
  - 0.906
  - 1.137
  - 1.418
  - 1.847
  - 1.556
  - 2.105
  - 2.388
  - 2.455
  - 2.592
  - 2.451
  - 2.144
  - 1.634
  - 2.122
  - 1.638
  - 1.423
  - 1.22
  - 1.601
  - 1.462
  - 1.339
  - 1.228
  - 1.445
  - 1.261
  - 1.169
  - 1.102
  - 1.11
  - 1.028
  - 0.992
  - 0.955
  - 1.048
  - 1.016
  - 0.964
  - 0.927
  - 0.91
  - 0.967
  - 1.066
  - 1.138
  - 0.952
  - 1.057
  - 1.167
  - 1.288
  - 0.994
  - 1.135
  - 1.262
  - 1.583
  - 1.213
  - 1.513
  - 2.11
  - 2.396
  - 2.099
  - 2.591
  - 2.674
  - 2.828
  - 2.383
  - 2.485
  - 2.45
  - 2.286
  - 2.16
  - 2.099
  - 1.604
  - 1.411
  - 1.694
  - 1.332
  - 1.271
  - 1.217
  - 1.441
  - 1.38
  - 1.253
  - 1.151
  - 1.336
  - 1.175
  - 1.163
  - 1.147
tomorrow_valid: true
raw_today:
  - start: "2025-10-12T00:00:00+02:00"
    end: "2025-10-12T00:15:00+02:00"
    value: 0.059
  - start: "2025-10-12T00:15:00+02:00"
    end: "2025-10-12T00:30:00+02:00"
    value: 0.048
  - start: "2025-10-12T00:30:00+02:00"
    end: "2025-10-12T00:45:00+02:00"
    value: 0.041
  - start: "2025-10-12T00:45:00+02:00"
    end: "2025-10-12T01:00:00+02:00"
    value: 0.036
  - start: "2025-10-12T01:00:00+02:00"
    end: "2025-10-12T01:15:00+02:00"
    value: 0.035
  - start: "2025-10-12T01:15:00+02:00"
    end: "2025-10-12T01:30:00+02:00"
    value: 0.032
  - start: "2025-10-12T01:30:00+02:00"
    end: "2025-10-12T01:45:00+02:00"
    value: 0.031
  - start: "2025-10-12T01:45:00+02:00"
    end: "2025-10-12T02:00:00+02:00"
    value: 0.026
  - start: "2025-10-12T02:00:00+02:00"
    end: "2025-10-12T02:15:00+02:00"
    value: 0.033
  - start: "2025-10-12T02:15:00+02:00"
    end: "2025-10-12T02:30:00+02:00"
    value: 0.031
  - start: "2025-10-12T02:30:00+02:00"
    end: "2025-10-12T02:45:00+02:00"
    value: 0.023
  - start: "2025-10-12T02:45:00+02:00"
    end: "2025-10-12T03:00:00+02:00"
    value: 0.019
  - start: "2025-10-12T03:00:00+02:00"
    end: "2025-10-12T03:15:00+02:00"
    value: 0.019
  - start: "2025-10-12T03:15:00+02:00"
    end: "2025-10-12T03:30:00+02:00"
    value: 0.018
  - start: "2025-10-12T03:30:00+02:00"
    end: "2025-10-12T03:45:00+02:00"
    value: 0.017
  - start: "2025-10-12T03:45:00+02:00"
    end: "2025-10-12T04:00:00+02:00"
    value: 0.018
  - start: "2025-10-12T04:00:00+02:00"
    end: "2025-10-12T04:15:00+02:00"
    value: 0.016
  - start: "2025-10-12T04:15:00+02:00"
    end: "2025-10-12T04:30:00+02:00"
    value: 0.017
  - start: "2025-10-12T04:30:00+02:00"
    end: "2025-10-12T04:45:00+02:00"
    value: 0.017
  - start: "2025-10-12T04:45:00+02:00"
    end: "2025-10-12T05:00:00+02:00"
    value: 0.019
  - start: "2025-10-12T05:00:00+02:00"
    end: "2025-10-12T05:15:00+02:00"
    value: 0.012
  - start: "2025-10-12T05:15:00+02:00"
    end: "2025-10-12T05:30:00+02:00"
    value: 0.014
  - start: "2025-10-12T05:30:00+02:00"
    end: "2025-10-12T05:45:00+02:00"
    value: 0.016
  - start: "2025-10-12T05:45:00+02:00"
    end: "2025-10-12T06:00:00+02:00"
    value: 0.017
  - start: "2025-10-12T06:00:00+02:00"
    end: "2025-10-12T06:15:00+02:00"
    value: 0.014
  - start: "2025-10-12T06:15:00+02:00"
    end: "2025-10-12T06:30:00+02:00"
    value: 0.013
  - start: "2025-10-12T06:30:00+02:00"
    end: "2025-10-12T06:45:00+02:00"
    value: 0.015
  - start: "2025-10-12T06:45:00+02:00"
    end: "2025-10-12T07:00:00+02:00"
    value: 0.016
  - start: "2025-10-12T07:00:00+02:00"
    end: "2025-10-12T07:15:00+02:00"
    value: 0.019
  - start: "2025-10-12T07:15:00+02:00"
    end: "2025-10-12T07:30:00+02:00"
    value: 0.019
  - start: "2025-10-12T07:30:00+02:00"
    end: "2025-10-12T07:45:00+02:00"
    value: 0.035
  - start: "2025-10-12T07:45:00+02:00"
    end: "2025-10-12T08:00:00+02:00"
    value: 0.04
  - start: "2025-10-12T08:00:00+02:00"
    end: "2025-10-12T08:15:00+02:00"
    value: 0.04
  - start: "2025-10-12T08:15:00+02:00"
    end: "2025-10-12T08:30:00+02:00"
    value: 0.049
  - start: "2025-10-12T08:30:00+02:00"
    end: "2025-10-12T08:45:00+02:00"
    value: 0.049
  - start: "2025-10-12T08:45:00+02:00"
    end: "2025-10-12T09:00:00+02:00"
    value: 0.049
  - start: "2025-10-12T09:00:00+02:00"
    end: "2025-10-12T09:15:00+02:00"
    value: 0.047
  - start: "2025-10-12T09:15:00+02:00"
    end: "2025-10-12T09:30:00+02:00"
    value: 0.049
  - start: "2025-10-12T09:30:00+02:00"
    end: "2025-10-12T09:45:00+02:00"
    value: 0.046
  - start: "2025-10-12T09:45:00+02:00"
    end: "2025-10-12T10:00:00+02:00"
    value: 0.04
  - start: "2025-10-12T10:00:00+02:00"
    end: "2025-10-12T10:15:00+02:00"
    value: 0.048
  - start: "2025-10-12T10:15:00+02:00"
    end: "2025-10-12T10:30:00+02:00"
    value: 0.047
  - start: "2025-10-12T10:30:00+02:00"
    end: "2025-10-12T10:45:00+02:00"
    value: 0.044
  - start: "2025-10-12T10:45:00+02:00"
    end: "2025-10-12T11:00:00+02:00"
    value: 0.035
  - start: "2025-10-12T11:00:00+02:00"
    end: "2025-10-12T11:15:00+02:00"
    value: 0.05
  - start: "2025-10-12T11:15:00+02:00"
    end: "2025-10-12T11:30:00+02:00"
    value: 0.049
  - start: "2025-10-12T11:30:00+02:00"
    end: "2025-10-12T11:45:00+02:00"
    value: 0.049
  - start: "2025-10-12T11:45:00+02:00"
    end: "2025-10-12T12:00:00+02:00"
    value: 0.049
  - start: "2025-10-12T12:00:00+02:00"
    end: "2025-10-12T12:15:00+02:00"
    value: 0.048
  - start: "2025-10-12T12:15:00+02:00"
    end: "2025-10-12T12:30:00+02:00"
    value: 0.048
  - start: "2025-10-12T12:30:00+02:00"
    end: "2025-10-12T12:45:00+02:00"
    value: 0.048
  - start: "2025-10-12T12:45:00+02:00"
    end: "2025-10-12T13:00:00+02:00"
    value: 0.058
  - start: "2025-10-12T13:00:00+02:00"
    end: "2025-10-12T13:15:00+02:00"
    value: 0.056
  - start: "2025-10-12T13:15:00+02:00"
    end: "2025-10-12T13:30:00+02:00"
    value: 0.056
  - start: "2025-10-12T13:30:00+02:00"
    end: "2025-10-12T13:45:00+02:00"
    value: 0.055
  - start: "2025-10-12T13:45:00+02:00"
    end: "2025-10-12T14:00:00+02:00"
    value: 0.055
  - start: "2025-10-12T14:00:00+02:00"
    end: "2025-10-12T14:15:00+02:00"
    value: 0.055
  - start: "2025-10-12T14:15:00+02:00"
    end: "2025-10-12T14:30:00+02:00"
    value: 0.056
  - start: "2025-10-12T14:30:00+02:00"
    end: "2025-10-12T14:45:00+02:00"
    value: 0.058
  - start: "2025-10-12T14:45:00+02:00"
    end: "2025-10-12T15:00:00+02:00"
    value: 0.154
  - start: "2025-10-12T15:00:00+02:00"
    end: "2025-10-12T15:15:00+02:00"
    value: 0.059
  - start: "2025-10-12T15:15:00+02:00"
    end: "2025-10-12T15:30:00+02:00"
    value: 0.059
  - start: "2025-10-12T15:30:00+02:00"
    end: "2025-10-12T15:45:00+02:00"
    value: 0.16
  - start: "2025-10-12T15:45:00+02:00"
    end: "2025-10-12T16:00:00+02:00"
    value: 0.299
  - start: "2025-10-12T16:00:00+02:00"
    end: "2025-10-12T16:15:00+02:00"
    value: 0.298
  - start: "2025-10-12T16:15:00+02:00"
    end: "2025-10-12T16:30:00+02:00"
    value: 0.369
  - start: "2025-10-12T16:30:00+02:00"
    end: "2025-10-12T16:45:00+02:00"
    value: 0.359
  - start: "2025-10-12T16:45:00+02:00"
    end: "2025-10-12T17:00:00+02:00"
    value: 0.351
  - start: "2025-10-12T17:00:00+02:00"
    end: "2025-10-12T17:15:00+02:00"
    value: 0.37
  - start: "2025-10-12T17:15:00+02:00"
    end: "2025-10-12T17:30:00+02:00"
    value: 0.455
  - start: "2025-10-12T17:30:00+02:00"
    end: "2025-10-12T17:45:00+02:00"
    value: 0.65
  - start: "2025-10-12T17:45:00+02:00"
    end: "2025-10-12T18:00:00+02:00"
    value: 0.637
  - start: "2025-10-12T18:00:00+02:00"
    end: "2025-10-12T18:15:00+02:00"
    value: 0.718
  - start: "2025-10-12T18:15:00+02:00"
    end: "2025-10-12T18:30:00+02:00"
    value: 0.77
  - start: "2025-10-12T18:30:00+02:00"
    end: "2025-10-12T18:45:00+02:00"
    value: 0.795
  - start: "2025-10-12T18:45:00+02:00"
    end: "2025-10-12T19:00:00+02:00"
    value: 0.813
  - start: "2025-10-12T19:00:00+02:00"
    end: "2025-10-12T19:15:00+02:00"
    value: 0.691
  - start: "2025-10-12T19:15:00+02:00"
    end: "2025-10-12T19:30:00+02:00"
    value: 0.68
  - start: "2025-10-12T19:30:00+02:00"
    end: "2025-10-12T19:45:00+02:00"
    value: 0.651
  - start: "2025-10-12T19:45:00+02:00"
    end: "2025-10-12T20:00:00+02:00"
    value: 0.672
  - start: "2025-10-12T20:00:00+02:00"
    end: "2025-10-12T20:15:00+02:00"
    value: 0.653
  - start: "2025-10-12T20:15:00+02:00"
    end: "2025-10-12T20:30:00+02:00"
    value: 0.648
  - start: "2025-10-12T20:30:00+02:00"
    end: "2025-10-12T20:45:00+02:00"
    value: 0.652
  - start: "2025-10-12T20:45:00+02:00"
    end: "2025-10-12T21:00:00+02:00"
    value: 0.364
  - start: "2025-10-12T21:00:00+02:00"
    end: "2025-10-12T21:15:00+02:00"
    value: 0.635
  - start: "2025-10-12T21:15:00+02:00"
    end: "2025-10-12T21:30:00+02:00"
    value: 0.607
  - start: "2025-10-12T21:30:00+02:00"
    end: "2025-10-12T21:45:00+02:00"
    value: 0.346
  - start: "2025-10-12T21:45:00+02:00"
    end: "2025-10-12T22:00:00+02:00"
    value: 0.347
  - start: "2025-10-12T22:00:00+02:00"
    end: "2025-10-12T22:15:00+02:00"
    value: 0.386
  - start: "2025-10-12T22:15:00+02:00"
    end: "2025-10-12T22:30:00+02:00"
    value: 0.324
  - start: "2025-10-12T22:30:00+02:00"
    end: "2025-10-12T22:45:00+02:00"
    value: 0.338
  - start: "2025-10-12T22:45:00+02:00"
    end: "2025-10-12T23:00:00+02:00"
    value: 0.347
  - start: "2025-10-12T23:00:00+02:00"
    end: "2025-10-12T23:15:00+02:00"
    value: 0.332
  - start: "2025-10-12T23:15:00+02:00"
    end: "2025-10-12T23:30:00+02:00"
    value: 0.343
  - start: "2025-10-12T23:30:00+02:00"
    end: "2025-10-12T23:45:00+02:00"
    value: 0.345
  - start: "2025-10-12T23:45:00+02:00"
    end: "2025-10-13T00:00:00+02:00"
    value: 0.337
raw_tomorrow:
  - start: "2025-10-13T00:00:00+02:00"
    end: "2025-10-13T00:15:00+02:00"
    value: 0.334
  - start: "2025-10-13T00:15:00+02:00"
    end: "2025-10-13T00:30:00+02:00"
    value: 0.365
  - start: "2025-10-13T00:30:00+02:00"
    end: "2025-10-13T00:45:00+02:00"
    value: 0.361
  - start: "2025-10-13T00:45:00+02:00"
    end: "2025-10-13T01:00:00+02:00"
    value: 0.303
  - start: "2025-10-13T01:00:00+02:00"
    end: "2025-10-13T01:15:00+02:00"
    value: 0.286
  - start: "2025-10-13T01:15:00+02:00"
    end: "2025-10-13T01:30:00+02:00"
    value: 0.283
  - start: "2025-10-13T01:30:00+02:00"
    end: "2025-10-13T01:45:00+02:00"
    value: 0.284
  - start: "2025-10-13T01:45:00+02:00"
    end: "2025-10-13T02:00:00+02:00"
    value: 0.283
  - start: "2025-10-13T02:00:00+02:00"
    end: "2025-10-13T02:15:00+02:00"
    value: 0.281
  - start: "2025-10-13T02:15:00+02:00"
    end: "2025-10-13T02:30:00+02:00"
    value: 0.278
  - start: "2025-10-13T02:30:00+02:00"
    end: "2025-10-13T02:45:00+02:00"
    value: 0.28
  - start: "2025-10-13T02:45:00+02:00"
    end: "2025-10-13T03:00:00+02:00"
    value: 0.279
  - start: "2025-10-13T03:00:00+02:00"
    end: "2025-10-13T03:15:00+02:00"
    value: 0.266
  - start: "2025-10-13T03:15:00+02:00"
    end: "2025-10-13T03:30:00+02:00"
    value: 0.268
  - start: "2025-10-13T03:30:00+02:00"
    end: "2025-10-13T03:45:00+02:00"
    value: 0.266
  - start: "2025-10-13T03:45:00+02:00"
    end: "2025-10-13T04:00:00+02:00"
    value: 0.267
  - start: "2025-10-13T04:00:00+02:00"
    end: "2025-10-13T04:15:00+02:00"
    value: 0.361
  - start: "2025-10-13T04:15:00+02:00"
    end: "2025-10-13T04:30:00+02:00"
    value: 0.373
  - start: "2025-10-13T04:30:00+02:00"
    end: "2025-10-13T04:45:00+02:00"
    value: 0.725
  - start: "2025-10-13T04:45:00+02:00"
    end: "2025-10-13T05:00:00+02:00"
    value: 0.731
  - start: "2025-10-13T05:00:00+02:00"
    end: "2025-10-13T05:15:00+02:00"
    value: 0.669
  - start: "2025-10-13T05:15:00+02:00"
    end: "2025-10-13T05:30:00+02:00"
    value: 0.773
  - start: "2025-10-13T05:30:00+02:00"
    end: "2025-10-13T05:45:00+02:00"
    value: 0.821
  - start: "2025-10-13T05:45:00+02:00"
    end: "2025-10-13T06:00:00+02:00"
    value: 0.902
  - start: "2025-10-13T06:00:00+02:00"
    end: "2025-10-13T06:15:00+02:00"
    value: 0.906
  - start: "2025-10-13T06:15:00+02:00"
    end: "2025-10-13T06:30:00+02:00"
    value: 1.137
  - start: "2025-10-13T06:30:00+02:00"
    end: "2025-10-13T06:45:00+02:00"
    value: 1.418
  - start: "2025-10-13T06:45:00+02:00"
    end: "2025-10-13T07:00:00+02:00"
    value: 1.847
  - start: "2025-10-13T07:00:00+02:00"
    end: "2025-10-13T07:15:00+02:00"
    value: 1.556
  - start: "2025-10-13T07:15:00+02:00"
    end: "2025-10-13T07:30:00+02:00"
    value: 2.105
  - start: "2025-10-13T07:30:00+02:00"
    end: "2025-10-13T07:45:00+02:00"
    value: 2.388
  - start: "2025-10-13T07:45:00+02:00"
    end: "2025-10-13T08:00:00+02:00"
    value: 2.455
  - start: "2025-10-13T08:00:00+02:00"
    end: "2025-10-13T08:15:00+02:00"
    value: 2.592
  - start: "2025-10-13T08:15:00+02:00"
    end: "2025-10-13T08:30:00+02:00"
    value: 2.451
  - start: "2025-10-13T08:30:00+02:00"
    end: "2025-10-13T08:45:00+02:00"
    value: 2.144
  - start: "2025-10-13T08:45:00+02:00"
    end: "2025-10-13T09:00:00+02:00"
    value: 1.634
  - start: "2025-10-13T09:00:00+02:00"
    end: "2025-10-13T09:15:00+02:00"
    value: 2.122
  - start: "2025-10-13T09:15:00+02:00"
    end: "2025-10-13T09:30:00+02:00"
    value: 1.638
  - start: "2025-10-13T09:30:00+02:00"
    end: "2025-10-13T09:45:00+02:00"
    value: 1.423
  - start: "2025-10-13T09:45:00+02:00"
    end: "2025-10-13T10:00:00+02:00"
    value: 1.22
  - start: "2025-10-13T10:00:00+02:00"
    end: "2025-10-13T10:15:00+02:00"
    value: 1.601
  - start: "2025-10-13T10:15:00+02:00"
    end: "2025-10-13T10:30:00+02:00"
    value: 1.462
  - start: "2025-10-13T10:30:00+02:00"
    end: "2025-10-13T10:45:00+02:00"
    value: 1.339
  - start: "2025-10-13T10:45:00+02:00"
    end: "2025-10-13T11:00:00+02:00"
    value: 1.228
  - start: "2025-10-13T11:00:00+02:00"
    end: "2025-10-13T11:15:00+02:00"
    value: 1.445
  - start: "2025-10-13T11:15:00+02:00"
    end: "2025-10-13T11:30:00+02:00"
    value: 1.261
  - start: "2025-10-13T11:30:00+02:00"
    end: "2025-10-13T11:45:00+02:00"
    value: 1.169
  - start: "2025-10-13T11:45:00+02:00"
    end: "2025-10-13T12:00:00+02:00"
    value: 1.102
  - start: "2025-10-13T12:00:00+02:00"
    end: "2025-10-13T12:15:00+02:00"
    value: 1.11
  - start: "2025-10-13T12:15:00+02:00"
    end: "2025-10-13T12:30:00+02:00"
    value: 1.028
  - start: "2025-10-13T12:30:00+02:00"
    end: "2025-10-13T12:45:00+02:00"
    value: 0.992
  - start: "2025-10-13T12:45:00+02:00"
    end: "2025-10-13T13:00:00+02:00"
    value: 0.955
  - start: "2025-10-13T13:00:00+02:00"
    end: "2025-10-13T13:15:00+02:00"
    value: 1.048
  - start: "2025-10-13T13:15:00+02:00"
    end: "2025-10-13T13:30:00+02:00"
    value: 1.016
  - start: "2025-10-13T13:30:00+02:00"
    end: "2025-10-13T13:45:00+02:00"
    value: 0.964
  - start: "2025-10-13T13:45:00+02:00"
    end: "2025-10-13T14:00:00+02:00"
    value: 0.927
  - start: "2025-10-13T14:00:00+02:00"
    end: "2025-10-13T14:15:00+02:00"
    value: 0.91
  - start: "2025-10-13T14:15:00+02:00"
    end: "2025-10-13T14:30:00+02:00"
    value: 0.967
  - start: "2025-10-13T14:30:00+02:00"
    end: "2025-10-13T14:45:00+02:00"
    value: 1.066
  - start: "2025-10-13T14:45:00+02:00"
    end: "2025-10-13T15:00:00+02:00"
    value: 1.138
  - start: "2025-10-13T15:00:00+02:00"
    end: "2025-10-13T15:15:00+02:00"
    value: 0.952
  - start: "2025-10-13T15:15:00+02:00"
    end: "2025-10-13T15:30:00+02:00"
    value: 1.057
  - start: "2025-10-13T15:30:00+02:00"
    end: "2025-10-13T15:45:00+02:00"
    value: 1.167
  - start: "2025-10-13T15:45:00+02:00"
    end: "2025-10-13T16:00:00+02:00"
    value: 1.288
  - start: "2025-10-13T16:00:00+02:00"
    end: "2025-10-13T16:15:00+02:00"
    value: 0.994
  - start: "2025-10-13T16:15:00+02:00"
    end: "2025-10-13T16:30:00+02:00"
    value: 1.135
  - start: "2025-10-13T16:30:00+02:00"
    end: "2025-10-13T16:45:00+02:00"
    value: 1.262
  - start: "2025-10-13T16:45:00+02:00"
    end: "2025-10-13T17:00:00+02:00"
    value: 1.583
  - start: "2025-10-13T17:00:00+02:00"
    end: "2025-10-13T17:15:00+02:00"
    value: 1.213
  - start: "2025-10-13T17:15:00+02:00"
    end: "2025-10-13T17:30:00+02:00"
    value: 1.513
  - start: "2025-10-13T17:30:00+02:00"
    end: "2025-10-13T17:45:00+02:00"
    value: 2.11
  - start: "2025-10-13T17:45:00+02:00"
    end: "2025-10-13T18:00:00+02:00"
    value: 2.396
  - start: "2025-10-13T18:00:00+02:00"
    end: "2025-10-13T18:15:00+02:00"
    value: 2.099
  - start: "2025-10-13T18:15:00+02:00"
    end: "2025-10-13T18:30:00+02:00"
    value: 2.591
  - start: "2025-10-13T18:30:00+02:00"
    end: "2025-10-13T18:45:00+02:00"
    value: 2.674
  - start: "2025-10-13T18:45:00+02:00"
    end: "2025-10-13T19:00:00+02:00"
    value: 2.828
  - start: "2025-10-13T19:00:00+02:00"
    end: "2025-10-13T19:15:00+02:00"
    value: 2.383
  - start: "2025-10-13T19:15:00+02:00"
    end: "2025-10-13T19:30:00+02:00"
    value: 2.485
  - start: "2025-10-13T19:30:00+02:00"
    end: "2025-10-13T19:45:00+02:00"
    value: 2.45
  - start: "2025-10-13T19:45:00+02:00"
    end: "2025-10-13T20:00:00+02:00"
    value: 2.286
  - start: "2025-10-13T20:00:00+02:00"
    end: "2025-10-13T20:15:00+02:00"
    value: 2.16
  - start: "2025-10-13T20:15:00+02:00"
    end: "2025-10-13T20:30:00+02:00"
    value: 2.099
  - start: "2025-10-13T20:30:00+02:00"
    end: "2025-10-13T20:45:00+02:00"
    value: 1.604
  - start: "2025-10-13T20:45:00+02:00"
    end: "2025-10-13T21:00:00+02:00"
    value: 1.411
  - start: "2025-10-13T21:00:00+02:00"
    end: "2025-10-13T21:15:00+02:00"
    value: 1.694
  - start: "2025-10-13T21:15:00+02:00"
    end: "2025-10-13T21:30:00+02:00"
    value: 1.332
  - start: "2025-10-13T21:30:00+02:00"
    end: "2025-10-13T21:45:00+02:00"
    value: 1.271
  - start: "2025-10-13T21:45:00+02:00"
    end: "2025-10-13T22:00:00+02:00"
    value: 1.217
  - start: "2025-10-13T22:00:00+02:00"
    end: "2025-10-13T22:15:00+02:00"
    value: 1.441
  - start: "2025-10-13T22:15:00+02:00"
    end: "2025-10-13T22:30:00+02:00"
    value: 1.38
  - start: "2025-10-13T22:30:00+02:00"
    end: "2025-10-13T22:45:00+02:00"
    value: 1.253
  - start: "2025-10-13T22:45:00+02:00"
    end: "2025-10-13T23:00:00+02:00"
    value: 1.151
  - start: "2025-10-13T23:00:00+02:00"
    end: "2025-10-13T23:15:00+02:00"
    value: 1.336
  - start: "2025-10-13T23:15:00+02:00"
    end: "2025-10-13T23:30:00+02:00"
    value: 1.175
  - start: "2025-10-13T23:30:00+02:00"
    end: "2025-10-13T23:45:00+02:00"
    value: 1.163
  - start: "2025-10-13T23:45:00+02:00"
    end: "2025-10-14T00:00:00+02:00"
    value: 1.147
current_price: 0.298
additional_costs_current_hour: 0
price_in_cents: false
unit_of_measurement: SEK/kWh
device_class: monetary
icon: mdi:flash
friendly_name: nordpool_kwh_se4_sek_3_10_0
